package ru.netology.servis.attachment.docAttachment

object Preview {
//    preview object Информация для предварительного просмотра файла. Может содержать следующие поля:
//    • photo (object) — изображения для предпросмотра. Содержит единственное поле:
//    • sizes (array) — массив копий изображения в разных размерах. Подробное описание структуры вы найдёте на этой странице.
//    • graffiti (object) — данные о граффити. Содержит следующие поля:
//    • src (string) — URL файла с граффити;
//    • width (integer) — ширина изображения в px;
//    • height (integer) — высота изображения в px.
//    • audio_message — данные об аудиосообщении. Объект, который содержит следующие поля:
//    • duration (integer) — длительность аудиосообщения в секундах;
//    • waveform (array) — массив значений (integer) для визуального отображения звука;
//    • link_ogg (string) — URL .ogg-файла;
//    •link_mp3 (string) — URL .mp3-файла.
}